/*********************************************************
* @brief	キューのヘッダーファイル
* @date		2022/10/20
********************************************************/
#pragma once
#include "DoubleLinkedList.h"

/*********************************************************
* @brief		キュー
* @details		キューのテンプレート
* @tparam		DataType: データの型
********************************************************/
template <class DataType>
class Queue
{
private:
	// @brief		双方向リスト
	DoubleLinkedList<DataType> list;

public:

	//const メソッド

	/*********************************************************
	* @brief	要素数を取得する
	* @return	要素数を返す
	********************************************************/
	const int Count() const;

	/*********************************************************
	* @brief	プッシュ
	* @details	先頭に要素を追加する。
	* @param	data: 追加したい要素
	* @retval	true: プッシュ成功の場合	
	* @retval	false: プッシュ失敗の場合
	********************************************************/
	bool Push(DataType data);

	/*********************************************************
	* @brief	ポップ
	* @details	末尾の要素を取り出す。
	* @return	末尾の要素
	********************************************************/
	DataType& Pop();
};

#include "Queue.inl"
